In [18]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from io import StringIO
from sklearn.impute import SimpleImputer

csv_data = '''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,0.99,8.0
10.0,11.0,12.0
32.0,,22.0
43.0,,2.0'''

In [19]:
df = pd.read_csv(StringIO(csv_data))
df

      A     B      C    D
0   1.0   2.0   3.00  4.0
1   5.0   6.0   0.99  8.0
2  10.0  11.0  12.00  NaN
3  32.0   NaN  22.00  NaN
4  43.0   NaN   2.00  NaN

In [20]:
df.isnull().sum()

A    0
B    2
C    0
D    3
dtype: int64

In [21]:
df.values

array([[ 1.  ,  2.  ,  3.  ,  4.  ],
       [ 5.  ,  6.  ,  0.99,  8.  ],
       [10.  , 11.  , 12.  ,   nan],
       [32.  ,   nan, 22.  ,   nan],
       [43.  ,   nan,  2.  ,   nan]])

In [22]:
df.dropna(axis=0)

     A    B     C    D
0  1.0  2.0  3.00  4.0
1  5.0  6.0  0.99  8.0

In [23]:
df.dropna(axis=1)

      A      C
0   1.0   3.00
1   5.0   0.99
2  10.0  12.00
3  32.0  22.00
4  43.0   2.00

In [24]:
imr = SimpleImputer(missing_values=np.nan, strategy='mean')
#We can use 'most_frequent' for mode values or 'median' in place of mean in place of strategy 
imr = imr.fit(df.values)
imputed_data  = imr.transform(df.values)
imputed_data

array([[ 1.        ,  2.        ,  3.        ,  4.        ],
       [ 5.        ,  6.        ,  0.99      ,  8.        ],
       [10.        , 11.        , 12.        ,  6.        ],
       [32.        ,  6.33333333, 22.        ,  6.        ],
       [43.        ,  6.33333333,  2.        ,  6.        ]])

In [34]:
df.fillna(df.median())

      A     B      C    D
0   1.0   2.0   3.00  4.0
1   5.0   6.0   0.99  8.0
2  10.0  11.0  12.00  6.0
3  32.0   6.0  22.00  6.0
4  43.0   6.0   2.00  6.0

In [40]:
# Handling Categorical data
import pandas as pd
df = pd.DataFrame([
    ['green', 'M', 10.1, 'class2'],
    ['red', 'L', 13.5, 'class1'],
    ['blue','XL',15.3, 'class3'],
    ['orange','M',1.3, 'class2']
])
df.columns=['color', 'size', 'price', 'Label']
df

    color size  price   Label
0   green    M   10.1  class2
1     red    L   13.5  class1
2    blue   XL   15.3  class3
3  orange    M    1.3  class2

In [41]:
size_mapping = {'XL':2,'L':1, 'M': 0}
df['size'] = df['size'].map(size_mapping)
df

    color  size  price   Label
0   green     0   10.1  class2
1     red     1   13.5  class1
2    blue     2   15.3  class3
3  orange     0    1.3  class2

In [42]:
inv_size_mapping = {v: k for k, v in size_mapping.items()}
df['size'].map(inv_size_mapping)

0     M
1     L
2    XL
3     M
Name: size, dtype: object

In [43]:
# Label Encoding
import numpy as np
class_mapping  = {label: idx for idx, label in enumerate(np.unique(df['Label']))}
class_mapping

{'class1': 0, 'class2': 1, 'class3': 2}

In [44]:
df['Label'] = df['Label'].map(class_mapping)
df

    color  size  price  Label
0   green     0   10.1      1
1     red     1   13.5      0
2    blue     2   15.3      2
3  orange     0    1.3      1

In [45]:
inv_class_mapping = {v: k for k, v in class_mapping.items()}
df['Label']=df['Label'].map(inv_class_mapping)
df

    color  size  price   Label
0   green     0   10.1  class2
1     red     1   13.5  class1
2    blue     2   15.3  class3
3  orange     0    1.3  class2